sysbench/results/aws/mysql/media/sequencial/read_10.txt
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1267294
        write:                           0
        other:                           181042
        total:                           1448336
    transactions:                        90521  (1507.74 per sec.)
    queries:                             1448336 (24123.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1507.7362
    time elapsed:                        60.0377s
    total number of events:              90521

Latency (ms):
         min:                                    4.59
         avg:                                   33.15
         max:                                  112.49
         95th percentile:                       38.94
         sum:                              3000515.31

Threads fairness:
    events (avg/stddev):           1810.4200/83.68
    execution time (avg/stddev):   60.0103/0.01